#include "watchdog.h"
//---------------------global variables-----------------------------------
volatile unsigned char data wdt_intval;
//------------------------------------------------------------------------
void WDT_Init(unsigned char interval) //using 0//установка интервала срабатывания сторожевого таймера, запуск	//небезопасная
{
	wdt_intval=interval;	
	WDWR=1;//WDWR=1-разрешение записи в регистр
	WDCON=wdt_intval;
	return;
}
//------------------------------------------------------------------------
void WDT_Clear(void) //using 0//сброс счетчика сторожевого таймера
{
	EA=0;

	WDWR=1;//WDWR=1-разрешение записи в регистр
	WDCON=wdt_intval;	

	EA=1;
	return;
}
//------------------------------------------------------------------------
